final List<Map<String, String>> lawData = [
  {
    "question": "স্বাস্থ্যবিধি ট্র্যাকিং জন্য ব্যবহৃত কিছু সাধারণ পদ্ধতি কি কি?",
    "answer": "স্বাস্থ্যবিধি ট্র্যাকিং করার জন্য শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য ইত্যাদি ট্র্যাক করা যায়।"
  },
  {
    "question": "স্বাস্থ্যবিধি ট্র্যাকিংয়ে কী ধরনের ডেটা ট্র্যাক করা যায়?",
    "answer": "শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, যৌন স্বাস্থ্য, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য, ব্যক্তিগত স্বাস্থ্য সমস্যা ইত্যাদি ট্র্যাক করা যায়।"
  },
  {
    "question": "স্বাস্থ্যবিধি ট্র্যাকিং রোগের বিস্তার রোধ করতে সাহায্য করতে পারে?",
    "answer": "নিয়মিত স্বাস্থ্যবিধি ট্র্যাকিং রোগের লক্ষণগুলি শনাক্ত করতে এবং প্রতিরোধমূলক ব্যবস্থা নিতে সহায়ক হতে পারে।"
  },
  {
    "question": "কিভাবে স্বাস্থ্যবিধি ট্র্যাকিং আচরণ পরিবর্তনকে উন্নীত করতে পারে?",
    "answer": "স্বাস্থ্যবিধি ট্র্যাকিংয়ের মাধ্যমে ব্যক্তি তাদের দৈনন্দিন অভ্যাস বিশ্লেষণ করতে পারে, যা ইতিবাচক আচরণ পরিবর্তনে সহায়তা করে।"
  },
];
