final List<List<Map<String, String>>> faqDataParts = [
  [
    {
      "question": "এই আইন গ্রাম আদালত আইন, ২০০৬ নামে অভিহিত হইবে৷",
      "answer": "ফৌজদারী কার্যবিধি এবং দেওয়ানী কার্যবিধিতে যাহা কিছুই থাকুক না কেন তফসিলের প্রথম অংশে বর্ণিত বিষয়াবলী সম্পর্কিত ফৌজদারী মামলা এবং দ্বিতীয় অংশে বর্ণিত বিষয়াবলী সম্পর্কিত দেওয়ানী মামলা, অতঃপর ভিন্ন রকম বিধান না থাকিলে, গ্রাম আদালত কর্তৃক বিচারযোগ্য হইবে এবং কোন ফৌজদারী বা দেওয়ানী আদালতের অনুরূপ কোন মামলা বা মোকদ্দমার বিচার করিবার এখতিয়ার থাকিবে না৷",
    },
    {
      "question": "বিষয় বা প্রসংগের পরিপন্থী কোন কিছু না থাকিলে, এই আইনে-",
      "answer": "গ্রাম আদালতে তফসিলের প্রথম অংশে বর্ণিত কোন ফৌজদারী মামলা বিচার্য হইবে না যদি উক্ত মামলায় অভিযুক্ত ব্যক্তি পূর্বে কোন সময়ে গ্রাম আদালত বা আমলযোগ্য অপরাধে অন্য কোন আদালত কর্তৃক দণ্ডপ্রাপ্ত হইয়া থাকেন], অথবা তফসিলের দ্বিতীয় অংশে বর্ণিত বিষয়াবলীর সহিত সম্পর্কিত কোন মামলাও গ্রাম আদালত কর্তৃক বিচার্য হইবে না, যদি-",
    },
    {
      "question": "ইউনিয়ন” অর্থ স্থানীয় সরকার (ইউনিয়ন পরিষদ) আইন, ২০০৯ (২০০৯ সনের ৬১ নং আইন) এর ধারা ২ এর দফা (৫) এ সংজ্ঞায়িত ইউনিয়ন;]",
      "answer": " যেক্ষেত্রে এই আইনের অধীন কোন মামলা গ্রাম আদালত কর্তৃক বিচারযোগ্য হয সেইক্ষেত্রে বিরোধের যে কোন পক্ষ উক্ত মামলা বিচারের নিমিত্ত গ্রাম আদালত গঠনের জন্য সংশ্লিষ্ট ইউনিয়ন পরিষদের চেয়ারম্যানের নিকট, নির্ধারিত পদ্ধতিতে, আবেদন করিতে পারিবেন এবং ইউনিয়ন পরিষদ চেয়ারম্যান, লিখিত কারণ দর্শাইয়া উক্ত আবেদনটি নাকচ না করিলে, নির্ধারিত পদ্ধতিতে, একটি গ্রাম আদালত গঠন করিবার উদ্যোগ গ্রহণ করিবেন৷",
    },
    {
      "question": "চেয়ারম্যান” অর্থ গ্রাম আদালতের চেয়ারম্যান;",
      "answer": "ইউনিয়ন পরিষদের চেয়ারম্যান গ্রাম আদালতের চেয়ারম্য্যন হইবেন, তবে যেক্ষেত্রে তিনি কোন কারণবশতঃ চেয়ারম্যান হিসাবে দায়িত্ব পালন করিতে অসমর্থ হন কিংবা তাঁহার নিরপেক্ষতা সম্পর্কে কোন পক্ষ কর্তৃক প্রশ্ন উত্থাপিত হয় সেইক্ষেত্রে, নির্ধারিত পদ্ধতিতে, উপ-ধারা (১) এ উল্লিখিত সদস্য ব্যতীত উক্ত ইউনিয়ন পরিষদের অন্য কোন সদস্য গ্রাম আদালতের চেয়ারম্যান হইবেন৷",
    },
  ],

  [
    {
      "question": "যেক্ষেত্রে ক্ষতিপূরণ প্রদানের জন্য গ্রাম আদালত কর্তৃক আদেশ প্রদান করা হয় এবং নির্ধারিত সময়ের মধ্যে উক্ত অর্থ প্রদান করা না হয়, সেইক্ষেত্রে চেয়ারম্যান উহা ইউনিয়ন পরিষদের বকেয়া কর আদায়ের পদ্ধতিতে ",
      "answer": "গ্রাম আদালতে তফসিলের প্রথম অংশে বর্ণিত কোন ফৌজদারী মামলা বিচার্য হইবে না যদি উক্ত মামলায় অভিযুক্ত ব্যক্তি পূর্বে কোন সময়ে গ্রাম আদালত বা আমলযোগ্য অপরাধে অন্য কোন আদালত কর্তৃক দণ্ডপ্রাপ্ত হইয়া থাকেন], অথবা তফসিলের দ্বিতীয় অংশে বর্ণিত বিষয়াবলীর সহিত সম্পর্কিত কোন মামলাও গ্রাম আদালত কর্তৃক বিচার্য হইবে না,",
    },
    {
      "question": "বিষয় বা প্রসংগের পরিপন্থী কোন কিছু না থাকিলে, এই আইনে-",
      "answer": "আমলযোগ্য অপরাধ” অর্থ ফৌজদারী কার্যবিধিতে সংজ্ঞায়িত Cognizable Offence;",
    },
    {
      "question": "ইউনিয়ন” অর্থ স্থানীয় সরকার (ইউনিয়ন পরিষদ) আইন, ২০০৯ (২০০৯ সনের ৬১ নং আইন) এর ধারা ২ এর দফা (৫) এ সংজ্ঞায়িত ইউনিয়ন;]",
      "answer": "ধারা ৫ এর অধীন গ্রাম আদালত গঠিত হইবার অনধিক ১৫ (পনের) দিনের মধ্যে গ্রাম আদালতের প্রথম অধিবেশন অনুষ্ঠিত হইবে এবং উক্ত অধিবেশনে গ্রাম আদালত উভয় পক্ষের শুনানী করিয়া মামলার বিচার্য বিষয় নির্ধারণ করিবে এবং পক্ষগণের মধ্যে আপোষ বা মীমাংসার মাধ্যমে বিচার্য বিষয় নিষ্পত্তির উদ্যোগ গ্রহণ করিবে।",
    },
    {
      "question": "চেয়ারম্যান” অর্থ গ্রাম আদালতের চেয়ারম্যান;",
      "answer": "প্রথম অংশে বর্ণিত ফৌজদারী মামলা দায়েরের ক্ষেত্রে অপরাধ সংঘটিত হইবার ৩০(ত্রিশ) দিনের মধ্যে; এবং দ্বিতীয় অংশের ক্রমিক নং ৩ এ বর্ণিত দেওয়ানী মামলা ব্যতীত অন্যান্য দেওয়ানী মামলা দায়েরের ক্ষেত্রে মামলার কারণ উদ্ভব হইবার ৬০(ষাট) দিনের মধ্যে সংশ্লিষ্ট ইউনিয়ন পরিষদ চেয়ারম্যানের নিকট আবেদন করিতে হইবে।",
    },
    // Add more FAQ maps as needed for Topic Pill 1.
  ],
  // FAQ items for Topic Pill 2
  [
    {
      "question": "এই আইন গ্রাম আদালত আইন, ২০০৬ নামে অভিহিত হইবে৷",
      "answer": "বিবাদের কোন পক্ষে যদি একাধিক ব্যক্তি থাকেন, তবে চেয়ারম্যান উক্ত পক্ষভুক্ত ব্যক্তিগণকে তাহাদের পক্ষের জন্য দুইজন সদস্য মনোনীত করিতে আহ্বান জানাইবেন এবং যদি তাঁহারা অনুরূপ মনোনয়নদানে ব্যর্থ হন তবে তিনি উক্ত ব্যক্তিগণের মধ্যে হইতে যে কোন একজনকে সদস্য মনোনয়ন করিবার জন্য ক্ষমতা প্রদান করিবেন এবং তদানুযায়ী অনুরূপ ক্ষমতাপ্রাপ্ত ব্যক্তি সদস্য মনোনয়ন করিবেন৷",
    },
    {
      "question": "বিষয় বা প্রসংগের পরিপন্থী কোন কিছু না থাকিলে, এই আইনে-",
      "answer": "তবে শর্ত থাকে যে, শুনানীর কার্যক্রম শুরু করিবার পূর্বে মামলার কোন পক্ষ, চেয়ারম্যানের অনুমতিক্রমে, যুক্তিসঙ্গত কারণ প্রদর্শন করিয়া, তৎকর্তৃক ইতোপূর্বে মনোনীত কোন সদস্যকে পরিবর্তন করিয়া অন্য কোন সদস্য মনোনয়ন করিতে পারিবেন।",
    },
    {
      "question": "ইউনিয়ন” অর্থ স্থানীয় সরকার (ইউনিয়ন পরিষদ) আইন, ২০০৯ (২০০৯ সনের ৬১ নং আইন) এর ধারা ২ এর দফা (৫) এ সংজ্ঞায়িত ইউনিয়ন;]",
      "answer": "“ইউনিয়ন পরিষদ” অর্থ স্থানীয় সরকার (ইউনিয়ন পরিষদ) আইন, ২০০৯ (২০০৯ সনের ৬১ নং আইন) এর ধারা ২ এর দফা (৬) এ সংজ্ঞায়িত ইউনিয়ন পরিষদ;]",
    },
    {
      "question": "রাম আদালাতের সিদ্ধান্ত তিন-দুই (৩:২) সংখ্যাগরিষ্ঠ ভোটে গৃহীত হইলে, সংক্ষুব্ধ পক্ষ, উক্ত সিদ্ধান্ত গ্রহণের ত্রিশদিনের মধ্যে, নির্ধারিত পদ্ধতিতে-",
      "answer": "গ্রাম আদালত তফসিলের দ্বিতীয় অংশে বর্ণিত বিষয়াবলীর সহিত সম্পর্কিত কোন মামলায় অনুরূপ বিষয়ে তফসিলে উল্লিখিত পরিমাণ অর্থ প্রদানের জন্য আদেশ প্রদান করিতে বা সম্পত্তির প্রকৃত মালিককে সম্পত্তি বা উহার দখল প্রত্যার্পণ করিবরা জন্য আদেশ প্রদান করিতে পারিবে৷  ",
    },
  ],
  [

    {
      "question":
      "স্বাস্থ্যবিধি ট্র্যাকিং জন্য ব্যবহৃত কিছু সাধারণ পদ্ধতি কি কি?",
      "answer":
      "স্বাস্থ্যবিধি ট্র্যাকিং করার জন্য শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য ইত্যাদি ট্র্যাক করা যায়।"
    },
    {
      "question":
      "স্বাস্থ্যবিধি ট্র্যাকিং জন্য ব্যবহৃত কিছু সাধারণ পদ্ধতি কি কি?",
      "answer":
      "স্বাস্থ্যবিধি ট্র্যাকিং করার জন্য শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য ইত্যাদি ট্র্যাক করা যায়।"
    },
    {
      "question":
      "স্বাস্থ্যবিধি ট্র্যাকিং জন্য ব্যবহৃত কিছু সাধারণ পদ্ধতি কি কি?",
      "answer":
      "স্বাস্থ্যবিধি ট্র্যাকিং করার জন্য শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য ইত্যাদি ট্র্যাক করা যায়।"
    },

  ],
  [
    {
      "question": "স্বাস্থ্যবিধি ট্র্যাকিংয়ে কী ধরনের ডেটা ট্র্যাক করা যায়?",
      "answer":
      "শারীরিক স্বাস্থ্য, খাদ্য এবং পুষ্টি রেকর্ড, যৌন স্বাস্থ্য, দৈনিক শারীরিক সক্রিয়তা, মানসিক স্বাস্থ্য, ব্যক্তিগত স্বাস্থ্য সমস্যা ইত্যাদি ট্র্যাক করা যায়।"
    },
  ],
  [
    {
      "question":
      "স্বাস্থ্যবিধি ট্র্যাকিং রোগের বিস্তার রোধ করতে সাহায্য করতে পারে?",
      "answer":
      "নিয়মিত স্বাস্থ্যবিধি ট্র্যাকিং রোগের লক্ষণগুলি শনাক্ত করতে এবং প্রতিরোধমূলক ব্যবস্থা নিতে সহায়ক হতে পারে।"
    },
  ],
  [
    {
      "question":
      "কিভাবে স্বাস্থ্যবিধি ট্র্যাকিং আচরণ পরিবর্তনকে উন্নীত করতে পারে?",
      "answer":
      "স্বাস্থ্যবিধি ট্র্যাকিংয়ের মাধ্যমে ব্যক্তি তাদের দৈনন্দিন অভ্যাস বিশ্লেষণ করতে পারে, যা ইতিবাচক আচরণ পরিবর্তনে সহায়তা করে।"
    },
  ],
];
final List<Map<String, String>> faqTopic = [
  {"topic": " মৌলিক বিষয়"},
  {"topic": " বিচারযোগ্য মামলা"},
  {"topic": " আবেদন"},
  {"topic": " গ্রাম আদালত গঠন"},
  {"topic": " গ্রাম আদালতের এখতিয়ার"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
  {"topic": " মৌলিক বিষয়"},
];
